# Q1: Write a python program to scrape data for “Data Analyst” Job position in “Bangalore” location. You have to scrape the job-title, job-location, company_name, experience_required. You have to scrape first 10 jobs data

In [1]:
!pip install selenium

Requirement already satisfied: selenium in c:\users\dell\anaconda3\lib\site-packages (4.15.2)
Requirement already satisfied: certifi>=2021.10.8 in c:\users\dell\anaconda3\lib\site-packages (from selenium) (2022.12.7)
Requirement already satisfied: urllib3[socks]<3,>=1.26 in c:\users\dell\anaconda3\lib\site-packages (from selenium) (1.26.14)
Requirement already satisfied: trio-websocket~=0.9 in c:\users\dell\anaconda3\lib\site-packages (from selenium) (0.11.1)
Requirement already satisfied: trio~=0.17 in c:\users\dell\anaconda3\lib\site-packages (from selenium) (0.23.1)
Requirement already satisfied: sortedcontainers in c:\users\dell\anaconda3\lib\site-packages (from trio~=0.17->selenium) (2.4.0)
Requirement already satisfied: exceptiongroup>=1.0.0rc9 in c:\users\dell\anaconda3\lib\site-packages (from trio~=0.17->selenium) (1.1.3)
Requirement already satisfied: attrs>=20.1.0 in c:\users\dell\anaconda3\lib\site-packages (from trio~=0.17->selenium) (22.1.0)
Requirement already satisfied: outcome in c:\users\dell\anaconda3\lib\site-packages (from trio~=0.17->selenium) (1.3.0.post0)
Requirement already satisfied: cffi>=1.14 in c:\users\dell\anaconda3\lib\site-packages (from trio~=0.17->selenium) (1.15.1)
Requirement already satisfied: sniffio>=1.3.0 in c:\users\dell\anaconda3\lib\site-packages (from trio~=0.17->selenium) (1.3.0)
Requirement already satisfied: idna in c:\users\dell\anaconda3\lib\site-packages (from trio~=0.17->selenium) (3.4)
Requirement already satisfied: wsproto>=0.14 in c:\users\dell\anaconda3\lib\site-packages (from trio-websocket~=0.9->selenium) (1.2.0)
Requirement already satisfied: PySocks!=1.5.7,<2.0,>=1.5.6 in c:\users\dell\anaconda3\lib\site-packages (from urllib3[socks]<3,>=1.26->selenium) (1.7.1)
Requirement already satisfied: pycparser in c:\users\dell\anaconda3\lib\site-packages (from cffi>=1.14->trio~=0.17->selenium) (2.21)
Requirement already satisfied: h11<1,>=0.9.0 in c:\users\dell\anaconda3\lib\site-packages (from wsproto>=0.14->trio-websocket~=0.9->selenium) (0.14.0)

In [2]:
import selenium
from selenium import webdriver
import pandas as pd
from selenium.webdriver.common.by import By
import warnings
warnings.filterwarnings("ignore")
import time

In [3]:
driver = webdriver.Chrome()

In [4]:
driver.get("https://www.shine.com/")

In [6]:
time.sleep(10)
allow_btn = driver.find_element(By.XPATH,"/html/body/div/div[2]/div/div/div/div/button")
allow_btn.click()

In [8]:
click = driver.find_element(By.CLASS_NAME,'searchBarInput')
click.click()

In [9]:
designation = driver.find_element(By.CLASS_NAME,"form-control")
designation.send_keys("Data Analyst")

In [10]:
location =driver.find_element(By.XPATH,'/html/body/div/div[4]/div/div[2]/div[2]/div/form/div/div[1]/ul/li[2]/div/input')
location.send_keys("Bangalore")

In [12]:
search = driver.find_element(By.CLASS_NAME,"searchForm_btnWrap_advance__VYBHN")
search.click()

In [14]:
time.sleep(10)
allow_btn = driver.find_element(By.XPATH,"/html/body/div[1]/div[2]/div/div/div/div/button")
allow_btn.click()

In [15]:
close = driver.find_element(By.XPATH,"/html/body/div[1]/div[1]/div[1]/div/div/button")
close.click()

In [16]:
job_title = []
title_tags =driver.find_elements(By.XPATH,'//h2[@itemprop="name"]//a')
for i in title_tags:
    title = i.text
    job_title.append(title)

In [17]:
print(len(job_title))

20

In [18]:
Loc = []

loc_tags = driver.find_elements(By.XPATH,'//div[@class=" jobCard_jobCard_lists_item__YxRkV jobCard_locationIcon__zrWt2"]')
for i in loc_tags:
    location =i.text
    Loc.append(location)

In [19]:
print(len(Loc))

20

In [20]:
company_name = []
com_tags = driver.find_elements(By.XPATH,'//div[@class="jobCard_jobCard_cName__mYnow"]//span')
for i in com_tags:
    company_name.append(i.text)

In [21]:
print(len(company_name))

20

In [22]:
exp_req =[]
exp_tags = driver.find_elements(By.XPATH,'//div[@class=" jobCard_jobCard_lists_item__YxRkV jobCard_jobIcon__3FB1t"]')
for i in exp_tags:
    exp_req.append(i.text)

In [23]:
print(len(exp_req))

20

In [24]:
df = pd.DataFrame({'Title':job_title,'Location':Loc,'Company Name':company_name,'Experience':exp_req})
df.head(10)

,Title,Location,Company Name,Experience
0,Data Analyst Vacancy,Bangalore\n+14,divya interprises,0 to 4 Yrs
1,Data Analyst Vacancy,Bangalore\n+14,divya interprises,0 to 4 Yrs
2,Clinical Data Analyst,Bangalore\n+4,quiscon biotech,0 to 2 Yrs
3,Data Analyst Urgent Recruitment,Bangalore\n+14,divya interprises,0 to 4 Yrs
4,Data Analyst Urgent Recruitment,Bangalore\n+14,divya interprises,0 to 4 Yrs
5,Data Analyst Urgent Recruitment,Bangalore\n+14,divya interprises,0 to 4 Yrs
6,Data Analyst 1,Bangalore,merck ltd,1 to 3 Yrs
7,Clinical Data Analyst,Bangalore\n+6,techno endura,0 to 1 Yr
8,Data Analytics - Analyst,Bangalore,jpmorgan,0 to 4 Yrs
9,Hiring For Data Analyst,Bangalore\n+14,divya interprises,0 to 4 Yrs

# Q2:Write a python program to scrape data for “Data Scientist” Job position in“Bangalore” location. Youhave to scrape the job-title, job-location, company_name. You have to scrape first 10 jobs data.This task will be done in following steps:

In [25]:
driver = webdriver.Chrome()

In [26]:
driver.get("https://www.shine.com/")

In [28]:
time.sleep(15)
allow_btn = driver.find_element(By.XPATH,"/html/body/div/div[2]/div/div/div/div/button")
allow_btn.click()

In [30]:
click = driver.find_element(By.CLASS_NAME,'searchBarInput')
click.click()

In [31]:
designation = driver.find_element(By.CLASS_NAME,"form-control")
designation.send_keys("Data Scientist")

In [32]:
location =driver.find_element(By.XPATH,'/html/body/div/div[4]/div/div[2]/div[2]/div/form/div/div[1]/ul/li[2]/div/input')
location.send_keys("Bangalore")

In [34]:
search = driver.find_element(By.CLASS_NAME,"searchForm_btnWrap_advance__VYBHN")
search.click()

In [35]:
time.sleep(15)
allow_btn = driver.find_element(By.XPATH,"/html/body/div[1]/div[2]/div/div/div/div/button")
allow_btn.click()

In [36]:
close = driver.find_element(By.XPATH,"/html/body/div[1]/div[1]/div[1]/div/div/button")
close.click()

In [37]:
job_title = []
title_tags =driver.find_elements(By.XPATH,'//h2[@itemprop="name"]//a')
for i in title_tags:
    title = i.text
    job_title.append(title)

In [38]:
Loc = []

loc_tags = driver.find_elements(By.XPATH,'//div[@class=" jobCard_jobCard_lists_item__YxRkV jobCard_locationIcon__zrWt2"]')
for i in loc_tags:
    location =i.text
    Loc.append(location)

In [39]:
company_name = []
com_tags = driver.find_elements(By.XPATH,'//div[@class="jobCard_jobCard_cName__mYnow"]//span')
for i in com_tags:
    company_name.append(i.text)

In [40]:
exp_req =[]
exp_tags = driver.find_elements(By.XPATH,'//div[@class=" jobCard_jobCard_lists_item__YxRkV jobCard_jobIcon__3FB1t"]')
for i in exp_tags:
    exp_req.append(i.text)

In [41]:
df = pd.DataFrame({'Title':job_title,'Location':Loc,'Company Name':company_name,'Experience':exp_req})
df.head(10)

,Title,Location,Company Name,Experience
0,Data Scientist Vacancy,Bangalore\n+14,divya interprises,0 to 4 Yrs
1,Data Scientist Urgent Recruitment,Bangalore\n+14,divya interprises,0 to 4 Yrs
2,Data Scientist- Bangalore,Bangalore,the fashion cosmo,0 to 3 Yrs
3,Data Scientist AI ML CV,Bangalore,bosch group,3 to 5 Yrs
4,Data Scientist-Bangalore,Bangalore,shiva hr services,0 to 3 Yrs
5,Data Scientist AI ML NLP,Bangalore,bosch group,3 to 5 Yrs
6,Phd Data Scientist,Bangalore,bosch group,2 to 5 Yrs
7,Hiring For Data Scientist,Bangalore\n+14,divya interprises,0 to 4 Yrs
8,Data Scientist,Bangalore,racanaa energy solution private lim...,3 to 6 Yrs
9,Staff Data Scientist & Team Lead,Bangalore,true caller,8 to 12 Yrs

# Q3: In this question you have to scrape data using the filters available on the webpage You have to use the location and salary filter. You have to scrape data for “Data Scientist” designation for first 10 job results. You have to scrape the job-title, job-location, company name, experience required. The location filter to be used is “Delhi/NCR”. The salary filter to be used is “3-6” lakhs

In [42]:
driver = webdriver.Chrome()

In [43]:
driver.get("https://www.shine.com/")

In [44]:
time.sleep(15)
allow_btn = driver.find_element(By.XPATH,"/html/body/div/div[2]/div/div/div/div/button")
allow_btn.click()

In [45]:
click = driver.find_element(By.CLASS_NAME,'searchBarInput')
click.click()

In [46]:
designation = driver.find_element(By.CLASS_NAME,"form-control")
designation.send_keys("Data Scientist")
time.sleep(3)
designation.click()

In [48]:
search = driver.find_element(By.CLASS_NAME,"searchForm_btnWrap_advance__VYBHN")
search.click()

In [50]:
time.sleep(10)
allow_btn = driver.find_element(By.XPATH,"/html/body/div[1]/div[2]/div/div/div/div/button")
allow_btn.click()

In [51]:
close = driver.find_element(By.XPATH,"/html/body/div[1]/div[1]/div[1]/div/div/button")
close.click()

In [52]:
Loc_fil = driver.find_element(By.CLASS_NAME,'filter_filter_lists_items__wlFfo')
Loc_fil.click()

In [53]:
location_name = driver.find_element(By.XPATH,'/html/body/div[1]/div[1]/div[3]/div/div[1]/div/div[2]/div[2]/div/div/div/div[3]/div/div/div/ul/li[10]/span/label')
location_name.click()

In [54]:
show_result = driver.find_element(By.XPATH,'//div[@class="filter_btnWrap__5ToWy"]//button[2]')
show_result.click()

In [55]:
sal_fil = driver.find_element(By.XPATH,'/html/body/div[1]/div[1]/div[3]/div/div[1]/div/div[2]/div/ul/li[3]/button')
sal_fil.click()

In [56]:
salary = driver.find_element(By.XPATH,'/html/body/div[1]/div[1]/div[3]/div/div[1]/div/div[2]/div[2]/div/div/div/div[3]/div/div/div/ul/li[3]/span/label')
salary.click()

In [57]:
show_result = driver.find_element(By.XPATH,'/html/body/div[1]/div[1]/div[3]/div/div[1]/div/div[2]/div[2]/div/div/div/div[4]/button[2]')
show_result.click()

In [58]:
job_title = []
title_tags =driver.find_elements(By.XPATH,'//h2[@itemprop="name"]//a')
for i in title_tags:
    title = i.text
    job_title.append(title)

In [59]:
Loc = []

loc_tags = driver.find_elements(By.XPATH,'//div[@class=" jobCard_jobCard_lists_item__YxRkV jobCard_locationIcon__zrWt2"]')
for i in loc_tags:
    location =i.text
    Loc.append(location)

In [60]:
company_name = []
com_tags = driver.find_elements(By.XPATH,'//div[@class="jobCard_jobCard_cName__mYnow"]//span')
for i in com_tags:
    company_name.append(i.text)

In [61]:
exp_req =[]
exp_tags = driver.find_elements(By.XPATH,'//div[@class=" jobCard_jobCard_lists_item__YxRkV jobCard_jobIcon__3FB1t"]')
for i in exp_tags:
    exp_req.append(i.text)

In [62]:
df = pd.DataFrame({'Title':job_title,'Location':Loc,'Company Name':company_name,'Experience':exp_req})
df.head(10)

,Title,Location,Company Name,Experience
0,Data Scientist- Delhi,Delhi,the fashion cosmo,0 to 3 Yrs
1,Data Scientist-Delhi,Delhi,shiva hr services,0 to 3 Yrs
2,Data Scientist- Delhi,Delhi,the fashion cosmo,0 to 3 Yrs
3,Data Scientist- Delhi,Delhi,the fashion cosmo,0 to 3 Yrs
4,Data Scientist,Delhi\n+4,acme services private limited,3 to 5 Yrs
5,Data Scientist,Delhi\n+6,quiscon biotech,0 to 1 Yr
6,Data Scientist,Delhi\n+4,acme services private limited,3 to 5 Yrs
7,Clinical Data Analyst,Delhi\n+6,techno endura,0 to 1 Yr
8,Data Modeler,Delhi\n+9,v-tech data outsourcing,0 to 2 Yrs
9,Biostatistician,Delhi\n+17,national seeds corporation limited,1 to 6 Yrs

# Q4: Scrape data of first 100 sunglasses listings on flipkart.com. You have to scrape four attributes:

In [63]:
driver = webdriver.Chrome()

In [64]:
driver.get("http://www.flipkart.com/")

In [65]:
close_btn = driver.find_element(By.XPATH,'/html/body/div[3]/div/span')
close_btn.click()

In [66]:
search_field= driver.find_element(By.CLASS_NAME,"Pke_EE")
search_field.send_keys("sunglasses")

In [67]:
search_btn = driver.find_element(By.XPATH,'/html/body/div[1]/div/div[1]/div/div/div/div/div[1]/div/div[1]/div/div[1]/header/div[1]/div[2]/form/div/button')
search_btn.click()

In [69]:
brand = []
discription = []
MRP =[]
start=0
end =3
for page in range(start,end):
    
    brand_name = driver.find_elements(By.XPATH,'//div[@class="_2WkVRV"]')
    for i in brand_name:
        brand.append(i.text)
    prod_dis = driver.find_elements(By.XPATH,'//a[@class="IRpwTa"]')
    for i in prod_dis:
        discription.append(i.text)
    price = driver.find_elements(By.XPATH,'//div[@class="_30jeq3"]')
    for i in price:
        MRP.append(i.text)
    next_btn = driver.find_element(By.XPATH,'//a[@class="_1LKTO3"]//span')
    next_btn.click()
    time.sleep(4)

In [71]:
print(len(discription),len(brand),len(MRP))

118 120 120

In [73]:
df = pd.DataFrame({'Brand':brand,'Price':MRP})

In [75]:
df1 = pd.DataFrame({"Product Discription":discription})

In [76]:
df2 = pd.concat([df,df1],axis = 1)
df2.head(100)

            Brand Price                                Product Discription
0       ROYAL SON  ₹339                   Mirrored Aviator Sunglasses (58)
1   VINCENT CHASE  ₹703  Polarized, UV Protection Retro Square Sunglass...
2            SRPM  ₹149             UV Protection Wayfarer Sunglasses (50)
3        Fastrack  ₹549             UV Protection Wayfarer Sunglasses (58)
4          GANSTA   ₹79  Night Vision, Riding Glasses Rectangular Sungl...
..            ...   ...                                                ...
95       Roadster  ₹199  UV Protection, Riding Glasses Rectangular Sung...
96      ROYAL SON  ₹424  Gradient, UV Protection Rectangular Sunglasses...
97   Singco India  ₹396          UV Protection Rectangular Sunglasses (59)
98         GANSTA   ₹79  UV Protection Sports, Wrap-around Sunglasses (70)
99       Roadster  ₹249  Polarized, UV Protection Wayfarer, Retro Squar...

[100 rows x 3 columns]

# Q5: Scrape 100 reviews data from flipkart.com for iphone11 phone. You have to go the link:

In [77]:
driver = webdriver.Chrome()

In [78]:
driver.get("https://www.flipkart.com/apple-iphone-11-black-64-gb/p/itm4e5041ba101fd?pid=MOBFWQ6BXGJCEYNY&lid=LSTMOBFWQ6BXGJCEYNYZE3ENS&marketplace=FLIPKART&q=iphone+11&store=tyy/4io&srno=s_1_1&otracker=AS_Query_HistoryAutoSuggest_6_0_na_na_na&otracker1=AS_Query_HistoryAutoSuggest_6_0_na_na_na&fm=organic&iid=e30aaa70-fe6e-466c-81d4-993e630ea913.MOBFWQ6BXGJCEYNY.SEARCH&ppt=hp&ppn=homepage&ssid=nseg9l47e80000001699187524593&qH=f6cdfdaa9f3c23f3")

In [79]:
all_reviews = driver.find_element(By.XPATH,'//div[@class="_3UAT2v _16PBlm"]//span')
all_reviews.click()

In [80]:
review = []
summery = []
start = 0
end =11
for page in range(start,end):
    
    rating_name = driver.find_elements(By.XPATH,'//p[@class="_2-N8zT"]')
    for i in rating_name:
        review.append(i.text)
    summery_name = driver.find_elements(By.XPATH,'//div[@class="t-ZTKy"]//div//div')
    for i in summery_name:
        summery.append(i.text) 
    next_btn = driver.find_element(By.XPATH,'/html/body/div[1]/div/div[3]/div/div/div[2]/div[13]/div/div/nav/a[11]')
    next_btn.click()
    time.sleep(3)

In [81]:
print(len(review),len(summery))

110 110

In [82]:
df = pd.DataFrame({'Reviews':review,"Review Summeries":summery})
df.head(100)

                Reviews                                   Review Summeries
0    Highly recommended  Awesome Battery Life...Camera clarity is too g...
1      Perfect product!                                       Photos super
2   Best in the market!                                        Good Camera
3        Classy product  Camera is awesome\nBest battery backup\nA perf...
4     Worth every penny  Feeling awesome after getting the delivery of ...
..                  ...                                                ...
95       Simply awesome  Best phone ur money can get specially if u wan...
96             Terrific    Very very good excellent thank you for Flipkart
97             Terrific  Wow I loved this😌❤️thank you Flipkart for show...
98            Brilliant                                      iPhone camera
99            Wonderful  Why is Apple not giving a charger with any of ...

[100 rows x 2 columns]

# Q6: Scrape data forfirst 100 sneakers you find whenyou visit flipkart.com and search for “sneakers” in the search field.

In [83]:
driver = webdriver.Chrome()

In [84]:
driver.get("http://www.flipkart.com/")

In [85]:
close_btn = driver.find_element(By.XPATH,'/html/body/div[3]/div/span')
close_btn.click()

In [86]:
search_field= driver.find_element(By.CLASS_NAME,"Pke_EE")
search_field.send_keys("sneakers")

In [87]:
search_btn = driver.find_element(By.XPATH,'/html/body/div[1]/div/div[1]/div/div/div/div/div[1]/div/div[1]/div/div[1]/header/div[1]/div[2]/form/div/button')
search_btn.click()

In [88]:
brand = []
discription = []
MRP =[]
start=0
end =3
for page in range(start,end):
    #for Brand Name
    brand_name = driver.find_elements(By.XPATH,'//div[@class="_2WkVRV"]')
    for i in brand_name:
        brand.append(i.text)
    # for Product Discription
    prod_dis = driver.find_elements(By.XPATH,'//a[@class="IRpwTa"]')
    for i in prod_dis:
        discription.append(i.text)
    # for price show    
    price = driver.find_elements(By.XPATH,'//div[@class="_30jeq3"]')
    for i in price:
        MRP.append(i.text)
    
    next_btn = driver.find_element(By.XPATH,'/html/body/div/div/div[3]/div[1]/div[2]/div[12]/div/div/nav/a[11]')
    next_btn.click()
    time.sleep(4)

In [89]:
print(len(brand),len(discription),len(MRP))

120 117 120

In [90]:
df = pd.DataFrame({'Brand':brand,'Price':MRP})

In [91]:
df1 = pd.DataFrame({'Product Discription':discription})

In [92]:
df2 = pd.concat([df,df1],axis=1)
df2.head(100)

,Brand,Price,Product Discription
0,BRUTON,₹497,Combo Pack Of 2 Men’s Casual Shoes Sneakers Fo...
1,BRUTON,₹497,!Combo Pack Of 2 Casual Shoes! Sneakers For Men
2,aadi,₹289,Synthetic Leather |Lightweight|Comfort|Summer|...
3,URBANBOX,₹299,Trending Stylish Casual Outdoor Sneakers Shoes...
4,Layasa,₹299,Sneakers For Men
...,...,...,...
95,HRX by Hrithik Roshan,₹924,Rerooted Classics Sneakers For Men
96,RapidBox,₹595,Sneakers For Men
97,Peelu,₹647,Synthetic Leather |Lightweight|Comfort|Summer|...
98,PUMA,"₹2,249",Smash V2 Buck Sneakers For Men
99,MEGPAR,₹419,Megpar White New Stylish Look Comfortable Casu...

# Q7: Go to webpage https://www.amazon.in/ Enter “Laptop” in the search field and then click the search icon. Then set CPU Type filter to “Intel Core i7” as shown in the below image:

In [93]:
driver = webdriver.Chrome()

In [94]:
driver.get("https://www.amazon.in/")

In [97]:
search_field= driver.find_element(By.ID,'nav-bb-search')
search_field.send_keys("Laptop")

In [99]:
search_btn = driver.find_element(By.XPATH,'//input[@class="nav-bb-button"]')
search_btn.click()

In [100]:
cpu = driver.find_element(By.XPATH,'/html/body/div[1]/div[1]/div[1]/div[2]/div/div[3]/span/div[1]/div/div/div[6]/ul[6]/span[12]/li/span/a/span')
cpu.click()

In [101]:
title = []
rating = []
MRP =[]
     #for Brand Name
title_name = driver.find_elements(By.XPATH,'//div[@class="a-section a-spacing-none puis-padding-right-small s-title-instructions-style"]')
for i in title_name:
    title.append(i.text)
    # for Product Discription
rating_num = driver.find_elements(By.XPATH,'//span[@class="a-size-base s-underline-text"]')
for i in rating_num:
    rating.append(i.text)
     # for price show    
price = driver.find_elements(By.XPATH,'//span[@class="a-price-whole"]')
for i in price:
    MRP.append(i.text)

In [102]:
print(len(title),len(rating),len(MRP))

24 21 23

In [103]:
df = pd.DataFrame({'Title':title})

In [104]:
df1 = pd.DataFrame({'Price':MRP})

In [105]:
df2 = pd.DataFrame({'rating':rating})

In [107]:
df3 = pd.concat([df,df1,df2],axis=1)
df3.head(10)

                                               Title   Price rating
0  MSI Modern 14, Intel 12th Gen. i7-1255U, 36CM ...  49,990     23
1  ASUS TUF Gaming F15, 15.6"(39.62 cms) FHD 144H...  68,990     52
2  Lenovo IdeaPad Slim 3 Intel Core i7 11th Gen 1...  52,990     59
3  MSI GF63 Thin, Intel Core i7-11800H, 40CM FHD ...  57,990    150
4  ASUS Vivobook 15, Intel Core i7-12650H 12th Ge...  60,990    330
5  HP Laptop 15s, 12th Gen Intel Core i7-1255U, 1...  63,990     20
6  MSI GF63 Thin, Intel Core i7-11800H, 40CM FHD ...  64,990     96
7  Dell Inspiron 5430 Laptop, Intel Core i7-1360P...  84,990     46
8  Acer Aspire Lite Premium Metal Laptop 11th Gen...  47,990    173
9  Samsung Galaxy Book3 Core i7 13th Gen 1355U - ...  84,390     28

# Q8: Write a python program to scrape data for Top 1000 Quotes of All Time.

In [108]:
driver = webdriver.Chrome()

In [109]:
driver.get("https://www.azquotes.com/")

In [110]:
top_quotes =driver.find_element(By.XPATH,'/html/body/div[1]/div[1]/div[1]/div/div[3]/ul/li[5]/a')
top_quotes.click()

In [111]:
quotes = []
author = []
type_of_quotes =[]
start = 0
end = 9

for pages in range(start,end):
    quotes_name = driver.find_elements(By.XPATH,'//a[@class="title"]')
    for i in quotes_name:
        quotes.append(i.text)
    author_name = driver.find_elements(By.XPATH,'//div[@class="author"]//a')
    for i in author_name:
        author.append(i.text)
    types = driver.find_elements(By.XPATH,'//div[@class="tags"]')
    for i in types:
        type_of_quotes.append(i.text)
    next_btn = driver.find_element(By.XPATH,'//li[@class="next"]//a')
    next_btn.click()
    time.sleep(2)

In [112]:
print(len(quotes),len(author),len(type_of_quotes))

900 900 900

In [113]:
df = pd.DataFrame({'Quotes':quotes,'Author Name':author,'Type of Quotes':type_of_quotes})
df

,Quotes,Author Name,Type of Quotes
0,The essence of strategy is choosing what not t...,Michael Porter,"Essence, Deep Thought, Transcendentalism"
1,One cannot and must not try to erase the past ...,Golda Meir,"Inspiration, Past, Trying"
2,Patriotism means to stand by the country. It d...,Theodore Roosevelt,"Country, Peace, War"
3,Death is something inevitable. When a man has ...,Nelson Mandela,"Inspirational, Motivational, Death"
4,You have to love a nation that celebrates its ...,Erma Bombeck,"4th Of July, Food, Patriotic"
...,...,...,...
895,To love means loving the unlovable. To forgive...,Gilbert K. Chesterton,"Love, Inspirational, Success"
896,Be brave. Take risks. Nothing can substitute e...,Paulo Coelho,"Encouraging, Courage, Inspiration"
897,"If you really want to do something, you'll fin...",Jim Rohn,"Inspirational, Motivational, Success"
898,It is neither wealth nor splendor; but tranqui...,Thomas Jefferson,"Life, Happiness, Work"
899,A thousand words will not leave so deep an imp...,Henrik Ibsen,"Inspirational, Inspiring, Positivity"

# Q9: Write a python program to display list of respected former Prime Ministers of India(i.e. Name, Born-Dead,Term of office, Remarks) from https://www.jagranjosh.com/.

In [114]:
driver = webdriver.Chrome()

In [115]:
driver.get("https://www.jagranjosh.com/")

In [116]:
GK =driver.find_element(By.XPATH,'/html/body/div[1]/header/nav/div/div/div[3]/ul/li[6]/a')
GK.click()

In [118]:
prime_ministers = driver.find_element(By.XPATH,'/html/body/div[2]/div/div/div[2]/div/div[10]/div/div/ul/li[2]/a')
prime_ministers.click()

In [120]:
data = []
table = driver.find_elements(By.XPATH,'//div[@class="table-box"]//table//tbody//tr[2]')
#rows = table.find_element(By.TAG_NAME,'tr')
for row in table:
    cols = row.find_elements(By.TAG_NAME,'td')
    
    if len(cols) == 5:
    
        name = cols[0].text
        born_dead = cols[1].text
        term_of_office = cols[2].text
        remarks = cols[3].text
    data.append([name, born_dead, term_of_office, remarks])

In [121]:
df = pd.DataFrame(data, columns=['Name', 'Born-Dead', 'Term of Office', 'Remarks'])
df

,Name,Born-Dead,Term of Office,Remarks
0,1.,Jawahar Lal Nehru,(1889–1964),"15 August 1947 to 27 May 1964\n16 years, 286 days"

# Q10: Write a python program to display list of 50 Most expensive cars in the world (i.e. Car name and Price) from https://www.motor1.com/

In [122]:
driver = webdriver.Chrome()

In [123]:
driver.get("https://www.motor1.com/")

In [124]:
search_bar = driver.find_element(By.XPATH,'//input[@class="m1-search-panel-input m1-search-form-text"]')
search_bar.send_keys('50 most expensive cars')

In [125]:
search_btn = driver.find_element(By.XPATH,'//button[@class="m1-search-panel-button m1-search-form-button-animate icon-search-svg"]')
search_btn.click()

In [126]:
world = driver.find_element(By.XPATH,'/html/body/div[10]/div[9]/div/div[1]/div/div/div[2]/div/div[1]/h3/a')
world.click()

In [127]:
car_name = []
price = []

title_name = driver.find_elements(By.XPATH,'//h3[@class="subheader"]')
for i in title_name:
    car_name.append(i.text)
    
mrp= driver.find_elements(By.TAG_NAME,'strong')
for i in mrp:
    price.append(i.text)

In [128]:
print(len(car_name),len(price))

51 50

In [129]:
df  = pd.DataFrame({'Car Name':car_name})

In [130]:
df1 = pd.DataFrame({'Price':price})

In [131]:
df2 = pd.concat([df,df1],axis=1)

In [132]:
df2.head(50)

                              Car Name                        Price
0                  Aston Martin Valour          Price: $1.5 Million
1                         McLaren Elva          Price: $1.7 Million
2                          Czinger 21C          Price: $1.7 Million
3                        Ferrari Monza          Price: $1.7 Million
4                   Gordon Murray T.33          Price: $1.7 Million
5                    Koenigsegg Gemera          Price: $1.7 Million
6                          Zenvo TSR-S          Price: $1.7 Million
7                   Hennessey Venom F5          Price: $1.8 Million
8                      Bentley Bacalar          Price: $1.9 Million
9        Hispano Suiza Carmen Boulogne          Price: $1.9 Million
10              Bentley Mulliner Batur          Price: $2.0 Million
11                        Deus Vayanne          Price: $2.0 Million
12                         SSC Tuatara          Price: $2.0 Million
13                         Lotus Evija          Price: $2.1 Million
14                 Aston Martin Vulcan          Price: $2.3 Million
15                          Delage D12          Price: $2.3 Million
16                 Ferrari Daytona SP3          Price: $2.3 Million
17                   McLaren Speedtail          Price: $2.3 Million
18                        Rimac Nevera          Price: $2.4 Million
19                       Pagani Utopia          Price: $2.5 Million
20                Pininfarina Battista          Price: $2.5 Million
21                  Gordon Murray T.50          Price: $2.6 Million
22                Lamborghini Countach          Price: $2.6 Million
23            Mercedes-AMG Project One          Price: $2.7 Million
24                        Zenvo Aurora          Price: $2.8 Million
25                 Aston Martin Victor          Price: $3.0 Million
26         Hennessey Venom F5 Roadster                 $3.0 Million
27                    Koenigsegg Jesko          Price: $3.0 Million
28               Aston Martin Valkyrie          Price: $3.2 Million
29           W Motors Lykan Hypersport          Price: $3.4 Million
30                       McLaren Solus                 $3.5 Million
31                    Lamborghini Sian          Price: $3.6 million
32                    Koenigsegg CC850          Price: $3.7 Million
33     Bugatti Chiron Super Sport 300+          Price: $3.9 Million
34                  Lamborghini Veneno          Price: $4.5 Million
35                      Bugatti Bolide          Price: $4.7 Million
36           Pininfarina B95 Speedster          Price: $4.8 Million
37                     Bugatti Mistral          Price: $5.0 Million
38                 Pagani Huayra Imola          Price: $5.4 Million
39                        Bugatti Divo          Price: $5.8 Million
40                 SP Automotive Chaos          Price: $6.4 Million
41                    Pagani Codalunga          Price: $7.4 Million
42                        777 Hypercar          Price: $7.5 Million
43            Mercedes-Maybach Exelero          Price: $8.0 Million
44                  Bugatti Centodieci          Price: $9.0 Million
45             Bugatti Chiron Profilée         Price: $10.8 Million
46                Rolls-Royce Sweptail         Price: $12.8 Million
47            Bugatti La Voiture Noire         Price: $13.4 Million
48              Rolls-Royce Boat Tail*  Price: $28.0 Million (est.)
49  Rolls-Royce La Rose Noire Droptail    Price: $30 Million (est.)